<?php

namespace Database\Seeders;

use App\Models\Faq;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class FaqSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {

        $faqs = [
            [
                'question' => [
                    'ru' => 'Какая допустимая скорость в городе?',
                    'kg' => 'Шаар ичинде уруксат берилген ылдамдык кандай?'
                ],
                'answer' => [
                    'ru' => 'Максимально допустимая скорость в населённых пунктах — 60 км/ч, если иное не указано знаками.',
                    'kg' => 'Калктуу конуштарда уруксат берилген максималдуу ылдамдык – 60 км/с, эгер жол белгилеринде башкача көрсөтүлбөсө.'
                ],
            ],
            [
                'question' => [
                    'ru' => 'Когда можно обгонять с правой стороны?',
                    'kg' => 'Оң тараптан качан озуп өтүүгө болот?'
                ],
                'answer' => [
                    'ru' => 'Обгон справа разрешён, если транспортное средство, находящееся слева, поворачивает налево.',
                    'kg' => 'Оң тараптан озуп өтүү сол тараптагы унаа солго бурулуп жаткан учурда гана уруксат берилет.'
                ],
            ],
            [
                'question' => [
                    'ru' => 'Нужно ли останавливаться перед пешеходным переходом?',
                    'kg' => 'Жөө жүрүүчү өтмөктүн алдында токтоо керекпи?'
                ],
                'answer' => [
                    'ru' => 'Да, водитель обязан уступить дорогу пешеходам и при необходимости остановиться.',
                    'kg' => 'Ооба, айдоочу жөө жүргүнчүнү өткөрүп берүү үчүн, зарыл болсо, токтоого милдеттүү.'
                ],
            ],
            [
                'question' => [
                    'ru' => 'Можно ли разговаривать по телефону за рулем?',
                    'kg' => 'Рулда отуруп телефон менен сүйлөшүүгө болобу?'
                ],
                'answer' => [
                    'ru' => 'Нет, если телефон не используется через устройство hands-free.',
                    'kg' => 'Жок, эгерде телефон атайын колсуз сүйлөшүү түзмөгү аркылуу колдонулбаса.'
                ],
            ],
        ];

        foreach ($faqs as $faq) {
            Faq::create($faq);
        }
    }
}
